---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementDomainData.Dispose
source: html/abacf262-ab20-03dd-8802-31d11b0e48d0.htm
---
# Autodesk.Revit.DB.SpatialElementDomainData.Dispose Method

Releases all resources used by the SpatialElementDomainData

## Syntax (C#)
```csharp
public void Dispose()
```